### Install psycopg2

In [2]:
!pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.8.6-cp38-cp38-win_amd64.whl (1.1 MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.8.6

In [4]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\rebekahdsk\anaconda3\lib\site-packages (1.3.18)

### Import dependencies
* sqlalchemy allows us to connect to sql databases through python
* psycopg2
* pandas makes it easier to read in data from sql

In [6]:
import psycopg2
import pandas as pd
from sqlalchemy import create_engine

### All items needed to connect to the database

In [ ]:
user = 'postgres'
password = 'postgres'
host = 'localhost'
port = 5432  
dbname = 'sakila'

### Create a query and then connect to the database

In [7]:
engine = create_engine(f'postgres://{user}:{password}@{host}:{port}/{dbname}')
engine = engine.connect()
conn = engine.connect()

In [8]:
data_df = pd.read_sql('SELECT * FROM actor', conn)

In [9]:
data_df

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-15 04:34:33
196       197      REESE          WEST 2006-02-15 04:34:33
197       198       MARY        KEITEL 2006-02-15 04:34:33
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]